{
  "reading": [
    {
      "title": "Why We Sleep: Unlocking the Power of Sleep and Dreams",
      "author": "Matthew Walker",
      "link": "https://www.goodreads.com/book/show/34466963-why-we-sleep"
    },
    {
      "title": "Immediate Family",
      "author": "Ashley Nelson Levy",
      "link": "https://www.goodreads.com/book/show/48804965-immediate-family"
    }
  ],
  "completed": [
    {
      "title": "October 24, 2023",
      "itemID": "books-10242023",
      "items": [
        {
        "title": "Life is Hard - How Philosophy Can Help Us Find Our Way",
        "author": "Kieran Setiya",
        "link": "https://www.goodreads.com/book/show/59785502-life-is-hard",
        "image":  "/images/books/life_is_hard.jpeg",
        "descriptions": [
          "This is a moral philosophy, i.e., philosophical self-help, book by Kieran Setiya. In his book, Kieran provides a reflection on how philosophy can help us navigate hardships in life, including pain, loneliness, grief, injustice and absurdity. The author challenges the idea that happiness is the ultimate goal of life that many pursuit. Instead, he argues that we should live well within our limits, acknowledge the difficulites that we have to deal with."
        ]
        }
      ]
    },
    {
      "title": "October 04, 2023",
      "itemID": "books-10042023",
      "items": [
        {
        "title": "Red, White & Royal Blue",
        "author": "Casey McQuiston",
        "link": "https://www.goodreads.com/book/show/41150487-red-white-royal-blue",
        "image":  "/images/books/red_white_and_royal_blue.jpeg",
        "descriptions": [
          "This contemporary queer romance novel revolves around the enemies-to-lovers story of Alex Claremont-Diaz, the First Son of the United States, and Prince Henry of Walves as they navigate the complex world of politics, family traditions, their feelings for each other, and their queer identities. Alex is sharp, passionate, and eager to jumpstart his own political career. Henry (full name: Henry Goerge Edward James Fox-Moutchristen-Windsor) is much more private and guarded - a prince with a smile \"made to be printed on money.\" The two young men first appeared in the novel as hating each other, however, after Henry kissed Alex in a snowy garden on New Year's Eve, their love swiftly developed.",
          "McQuiston paints an alternative reality in the US political landscape in 2020: the first female President of the United States is running for reelection. That landscape is background to the development of the relationship between Alex and Henry. They were trying to keep their love in secret away from the public. Eventually, their relationship was leaked, and the two characters faced with the challenges to come to term with the fallout. The political backdrop adds depth to the narrative, making the characters' growth and self-discovery all the more impactful.",
          "Personally, I don't take this novel as a work of serious fiction, and I believe it isn't the intention of McQuiston for it to be that way. While the writing is engaging and filled with witty banter, it can be overly empathic. The rivalry between Alex and Henry at the beginning of the novel seems exaggerated, and the \"happy ending\" feels like it didn't require much effort, and somehow not so important. And although the sex is fun, it is cliche and lack of depth into real 'sex' as often depicted in gay novels. However, I still enjoy reading this book. In McQuiston's world, we can be fun and enjoy ourselves. We can have heartbreaks, crushes, and ridiculous confrontations in the rain. Sometimes the plot feels silly and calorie-free. But who cares! Equality means having access to every type of narrative, from the weighty to the frivolous."
        ]
        }
      ]
    },
    {
      "title": "July 22, 2023",
      "itemID":"books-07222023",
      "items": [
        {
          "title": "On Earth We're Briefly Gorgeous",
          "author": "Ocean Vuong",
          "link": "https://www.goodreads.com/book/show/41880609-on-earth-we-re-briefly-gorgeous",
          "image":  "/images/books/on_earth_were_briefly_gorgeous.jpeg",
          "descriptions": [
            "\"On Earth We're Briefly Gorgeous\" by Ocean Vuong is a stunning and poetic debut novel that explores the complexities of identity, love, and family. The book is a letter from a son to his illiterate mother, filled with raw emotions and hauntingly beautiful prose. Vuong's writing is both lyrical and evocative, painting vivid pictures of his characters' struggles and triumphs. The narrative delves into the immigrant experience and the challenges of growing up in a multicultural society, making it a profoundly relevant and timely read. Throughout the book, Vuong's exploration of queerness and the nuances of human relationships adds depth and authenticity to the story, leaving readers with a lasting impact. This book is a profound and unforgettable tale that leaves an indelible mark on the reader's heart."
          ]
        }
      ]
    },
    {
      "title": "February 09, 2023",
      "itemID": "books-02092023",
      "items": [
        {
          "title": "Four Thousand Weeks: Time Management for Mortals",
          "author": "Oliver Burkeman",
          "link": "https://www.goodreads.com/book/show/54785515-four-thousand-weeks",
          "image":  "/images/books/four_thousand_weeks.jpeg",
          "descriptions": [
            "The book is a thought-provoking and insightful guide that challenges our perception of time and offers a fresh perspective on how to make the most of our limited time on this planet. In this book, Burkeman delves into the concept of time as a finite resource, emphasizing the urgency to reassess our priorities and make intentional choices to live a fulfilling life.",
            "Burkeman skillfully weaves together philosophical insights, scientific research, and practical tips to address the modern-day struggle with time management. By examining the psychological barriers that hinder our productivity and the societal pressures that drive us to constantly chase more, he encourages readers to reevaluate their relationship with time and find contentment in the present moment.",
            "One of the key takeaways from 'Four Thousand Weeks' is the notion of embracing imperfection and recognizing that time management is not about squeezing more tasks into our days but rather making meaningful choices about how we spend our time. Burkeman advocates for focusing on what truly matters, fostering deeper connections with others, and fostering self-compassion to build a life that aligns with our authentic values.",
            "The book also offers practical strategies to avoid distractions, overcome procrastination, and cultivate a mindful approach to time. Burkeman's engaging storytelling and witty prose make the journey through the pages an enjoyable and enlightening experience."
          ]
        }
      ]
    },
    {
      "title": "December 13, 2022",
      "itemID": "books-12132022",
      "items": [
        {
          "title": "Ego Is the Enemy",
          "author": "Ryan Holiday",
          "link": "https://www.goodreads.com/book/show/27036528-ego-is-the-enemy",
          "image": "/images/books/ego_is_the_enemy.jpg",
          "descriptions": [
            "Ego is always part of us, no matter what you do. It's one of the forces that push us forward, achieving what we want to achieve. At the same time, it is also the biggest enemy that prevents you from getting success. Whenever you have some failures, setbacks, it's our ego that consumes us in anger, resentment, and revenge.",
            "One way to win over our ego is to keep a student mindset as in always learning new things or when learning things, start as if you're a totally new student. Another way is to think and act according to a bigger purpose. When you achieve something at work, try not to think as if it's your own success, but it's a success achieved by you and your team. Similarly, think about the impacts you've made through your works, not jut about yourself.",
            "This was an relaxing read for me. The ideas presented in the book are easy to comprehend. The author illustrates his points with a host of examples from historical figures, politicians, businessmen, athletes, etc. Though I have read books with similar messages, I find it's beneficial to grasp over this book as a reflection about ego avoidance. One small minus of this book for me is that it seems to be in a chaotic organization of ideas, opinions, reflections."
          ]
        }
      ]
    }
  ]
}
