{
  "reading": [
    {
      "title": "Why We Sleep: Unlocking the Power of Sleep and Dreams",
      "author": "Matthew Walker",
      "link": "https://www.goodreads.com/book/show/34466963-why-we-sleep"
    },
    {
      "title": "Immediate Family",
      "author": "Ashley Nelson Levy",
      "link": "https://www.goodreads.com/book/show/48804965-immediate-family"
    }
  ],
  "completed": [
    {
      "title": "July 22, 2023",
      "itemID":"books-07222023",
      "items": [
        {
          "title": "On Earth We're Briefly Gorgeous",
          "author": "Ocean Vuong",
          "link": "https://www.goodreads.com/book/show/41880609-on-earth-we-re-briefly-gorgeous",
          "image":  "/images/books/on_earth_were_briefly_gorgeous.jpeg",
          "descriptions": [
            "The book is more about processing and articulating difficult memories than about direct communication."
          ]
        }
      ]
    },
    {
      "title": "February 09, 2023",
      "itemID": "books-02092023",
      "items": [
        {
          "title": "Four Thousand Weeks: Time Management for Mortals",
          "author": "Oliver Burkeman",
          "link": "https://www.goodreads.com/book/show/54785515-four-thousand-weeks",
          "image":  "/images/books/four_thousand_weeks.jpeg",
          "descriptions": []
        }
      ]
    },
    {
      "title": "December 13, 2022",
      "itemID": "books-12132022",
      "items": [
        {
          "title": "Ego Is the Enemy",
          "author": "Ryan Holiday",
          "link": "https://www.goodreads.com/book/show/27036528-ego-is-the-enemy",
          "image": "/images/books/ego_is_the_enemy.jpg",
          "descriptions": [
            "Ego is always part of us, no matter what you do. It's one of the forces that push us forward, achieving what we want to achieve. At the same time, it is also the biggest enemy that prevents you from getting success. Whenever you have some failures, setbacks, it's our ego that consumes us in anger, resentment, and revenge.",
            "One way to win over our ego is to keep a student mindset as in always learning new things or when learning things, start as if you're a totally new student. Another way is to think and act according to a bigger purpose. When you achieve something at work, try not to think as if it's your own success, but it's a success achieved by you and your team. Similarly, think about the impacts you've made through your works, not jut about yourself.",
            "This was an relaxing read for me. The ideas presented in the book are easy to comprehend. The author illustrates his points with a host of examples from historical figures, politicians, businessmen, athletes, etc. Though I have read books with similar messages, I find it's beneficial to grasp over this book as a reflection about ego avoidance. One small minus of this book for me is that it seems to be in a chaotic organization of ideas, opinions, reflections."
          ]
        }
      ]
    }
  ]
}
